In [2]:
from pandas import Series, DataFrame

In [3]:
import pandas as pd

In [4]:
obj = Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [11]:
obj2['a']

-5

In [12]:
obj2['d'] = 6

In [13]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [18]:
import numpy as np

In [19]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
't' in obj2

False

In [22]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon':16000, 'Utah': 5000}

In [23]:
obj3 = Series(sdata)

In [24]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
states = ['California','Ohio', 'Oregon', 'Texas']

In [27]:
obj4 = Series(sdata, index=states)

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [32]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [34]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [36]:
obj4.name = 'population'

In [37]:
obj4.index.name = 'state'

In [38]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [39]:
obj.index = ['Bob', 'Steve', 'Jeff','Ryan']

In [40]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [41]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'years' : [2000, 2001, 2002, 2001, 2002],
       'pop' : [1.5,1.7,3.6,2.4,2.9]}

In [42]:
frame = DataFrame(data)

In [43]:
frame

   pop   state  years
0  1.5    Ohio   2000
1  1.7    Ohio   2001
2  3.6    Ohio   2002
3  2.4  Nevada   2001
4  2.9  Nevada   2002

In [44]:
DataFrame(data, columns=['years','state','pop'])

   years   state  pop
0   2000    Ohio  1.5
1   2001    Ohio  1.7
2   2002    Ohio  3.6
3   2001  Nevada  2.4
4   2002  Nevada  2.9

In [45]:
frame2 = DataFrame(data, columns=['years','state','pop','debt'],
                  index = ['one','two','three','four','five'])

In [46]:
frame2

       years   state  pop debt
one     2000    Ohio  1.5  NaN
two     2001    Ohio  1.7  NaN
three   2002    Ohio  3.6  NaN
four    2001  Nevada  2.4  NaN
five    2002  Nevada  2.9  NaN

In [47]:
frame2.columns

Index([u'years', u'state', u'pop', u'debt'], dtype='object')

In [48]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [49]:
frame.years

0    2000
1    2001
2    2002
3    2001
4    2002
Name: years, dtype: int64

In [50]:
 frame2.ix['three']

years    2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [51]:
frame2['debt'] = 16.5

In [52]:
frame2

       years   state  pop  debt
one     2000    Ohio  1.5  16.5
two     2001    Ohio  1.7  16.5
three   2002    Ohio  3.6  16.5
four    2001  Nevada  2.4  16.5
five    2002  Nevada  2.9  16.5

In [53]:
frame2['debt'] = np.arange(5.)

In [54]:
frame2

       years   state  pop  debt
one     2000    Ohio  1.5   0.0
two     2001    Ohio  1.7   1.0
three   2002    Ohio  3.6   2.0
four    2001  Nevada  2.4   3.0
five    2002  Nevada  2.9   4.0

In [55]:
val = Series([-1.2, -1.5, -1.7], index = ['two','four','five'])

In [56]:
frame2['debt'] = val

In [57]:
frame2

       years   state  pop  debt
one     2000    Ohio  1.5   NaN
two     2001    Ohio  1.7  -1.2
three   2002    Ohio  3.6   NaN
four    2001  Nevada  2.4  -1.5
five    2002  Nevada  2.9  -1.7

In [58]:
frame2['eastern'] = frame2.state == 'Ohio'

In [59]:
frame2

       years   state  pop  debt eastern
one     2000    Ohio  1.5   NaN    True
two     2001    Ohio  1.7  -1.2    True
three   2002    Ohio  3.6   NaN    True
four    2001  Nevada  2.4  -1.5   False
five    2002  Nevada  2.9  -1.7   False

In [60]:
del frame2['eastern']

In [61]:
frame2

       years   state  pop  debt
one     2000    Ohio  1.5   NaN
two     2001    Ohio  1.7  -1.2
three   2002    Ohio  3.6   NaN
four    2001  Nevada  2.4  -1.5
five    2002  Nevada  2.9  -1.7

In [62]:
pop = {'Nevada': {2001: 2.4, 2002:2.9},
       'Ohio' : {2000: 1.5, 2001:1.7, 2002:3.6}}

In [63]:
frame3 = DataFrame(pop)

In [64]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [65]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [66]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [67]:
pdata = {'Ohio':frame3['Ohio'][:-1],
         'Nevada':frame3['Nevada'][:2]}

In [68]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [69]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [70]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [72]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, -1.5],
       [2002L, 'Nevada', 2.9, -1.7]], dtype=object)

In [73]:
obj = Series(range(3), index=['a','b','c'])

In [74]:
index = obj.index

In [75]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [76]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [77]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [78]:
index = pd.Index(np.arange(3))

In [79]:
obj2 = Series([1.5, -2.5, 0], index= index)

In [80]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [81]:
obj2.index is index

True

In [82]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [83]:
'Ohio' in frame3.columns

True

In [84]:
2003 in frame3.index

False

In [85]:
obj = Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [86]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [87]:
obj.reindex(['a','b','c','d','e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [88]:
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])

In [89]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [90]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [91]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['Ohio','Texas','California'])

In [92]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [93]:
frame2 = frame.reindex(['a','b','c','d'])

In [94]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [95]:
states=['Texas','Utah','California']

In [96]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [97]:
frame.reindex(index=['a','b','c','d'],method='ffill', columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [98]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [99]:
obj = Series(np.arange(5.), index= ['a','b','c','d','e'])

In [100]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [101]:
new_obj = obj.drop('c')

In [102]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [103]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [104]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'], columns=['one','two','three','four'])

In [105]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [108]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [109]:
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [110]:
obj['b']

1.0

In [111]:
obj[1]

1.0

In [112]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [113]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [114]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [115]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [116]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [117]:
obj['b':'c'] = 5

In [118]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [119]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'],
                 columns= ['one','two','three','four'])

In [120]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [122]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [123]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [124]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [125]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [126]:
data[data<5]=0

In [127]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [129]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [130]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [131]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [132]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [133]:
s1 = Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])

In [134]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index= ['a','c','e','f','g'])

In [135]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [136]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [137]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [138]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
               index=['Ohio','Texas','Colorado'])

In [139]:
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns = list('bde'),
                index=['Utah','Ohio','Texas','Oregon'])

In [140]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [141]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [142]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [143]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))

In [145]:
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [146]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [147]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [148]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [150]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [152]:
df1.reindex(columns=df2.columns, fill_vlue=0)

TypeError: reindex() got an unexpected keyword argument "fill_vlue"

In [153]:
arr = np.arange(12.).reshape((3,4))

In [154]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [155]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [156]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [158]:
frame = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'), index=['Utah','Ohio','Texas','Oregon'])

In [159]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [160]:
series = frame.ix[0]

In [161]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [162]:
series2 = Series(range(3), index=['b','e','f'])

In [163]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [164]:
series3 = frame['d']

In [165]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [166]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [167]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Function application and mapping

In [168]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'), index = ['Utah','Ohio','Texas','Oregon'])

In [169]:
frame

               b         d         e
Utah   -0.042648  1.385007 -0.570970
Ohio    0.246658 -0.185175 -0.255187
Texas   0.087302 -0.862430  0.523400
Oregon -0.460442  0.109228  1.787665

In [170]:
np.abs(frame)

               b         d         e
Utah    0.042648  1.385007  0.570970
Ohio    0.246658  0.185175  0.255187
Texas   0.087302  0.862430  0.523400
Oregon  0.460442  0.109228  1.787665

In [171]:
f = lambda x: x.max() - x.min()

In [172]:
frame.apply(f)

b    0.707100
d    2.247437
e    2.358634
dtype: float64

In [173]:
frame.apply(f,axis=1)

Utah      1.955977
Ohio      0.501844
Texas     1.385830
Oregon    2.248107
dtype: float64

In [174]:
def f(x):
    return Series([x.min(),x.max()], index=['min','max'])

In [175]:
frame.apply(f)

            b         d         e
min -0.460442 -0.862430 -0.570970
max  0.246658  1.385007  1.787665

In [176]:
format = lambda x: '%.2f' % x

In [178]:
frame.applymap(format)

            b      d      e
Utah    -0.04   1.39  -0.57
Ohio     0.25  -0.19  -0.26
Texas    0.09  -0.86   0.52
Oregon  -0.46   0.11   1.79

In [179]:
frame['e'].map(format)

Utah      -0.57
Ohio      -0.26
Texas      0.52
Oregon     1.79
Name: e, dtype: object

# Sorting and Ranking

In [180]:
obj = Series(range(4), index=['d','a','b','c'])

In [181]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [182]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [183]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'],
                  columns = ['d','a','b','c'])

In [184]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [185]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [186]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [187]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [188]:
obj=Series([4,7,-3,2])

In [189]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [190]:
obj.order()

C:\Users\Tapan Chovatia\GraphLab\Anaconda2\envs\gl-env\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

2   -3
3    2
0    4
1    7
dtype: int64

In [191]:
obj = Series([4,np.nan,7,np.nan,-3,2])

In [192]:
obj.order()

C:\Users\Tapan Chovatia\GraphLab\Anaconda2\envs\gl-env\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [194]:
frame = DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})

In [195]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [196]:
frame.sort_index(by='b')

C:\Users\Tapan Chovatia\GraphLab\Anaconda2\envs\gl-env\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [197]:
frame.sort_index(by=['a','b'])

C:\Users\Tapan Chovatia\GraphLab\Anaconda2\envs\gl-env\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [198]:
obj = Series([7,-5,7,4,2,0,4])

In [199]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [200]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [201]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [202]:
frame = DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1],
                   'c':[-2,5,8,-2.5]})

In [203]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [204]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [205]:
obj = Series(range(5), index=['a','a','b','b','c'])

In [206]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [208]:
obj.index.is_unique

False

In [209]:
obj['a']

a    0
a    1
dtype: int64

In [210]:
obj['c']

4

In [211]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [212]:
df

          0         1         2
a  1.003436  0.198269 -1.116821
a -0.339268  0.277970  1.627822
b -1.726144  2.029090  0.664496
b  1.551101  1.941939  1.022663

In [213]:
df.ix['b']

          0         1         2
b -1.726144  2.029090  0.664496
b  1.551101  1.941939  1.022663

# Summarizing and Computind Descriptive Statistics

In [215]:
df = DataFrame([[1.4, np.nan],[7.1, -4.5],[ np.nan,np.nan],[0.75,-1.3]], index=['a','b','c','d'], columns=['one','two'])

In [216]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [217]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [218]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [219]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [221]:
df.idxmax()

one    b
two    d
dtype: object

In [222]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [223]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [224]:
obj = Series(['a','a','b','c'] *  4)

In [225]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [226]:
import pandas.io.data as web

C:\Users\Tapan Chovatia\GraphLab\Anaconda2\envs\gl-env\lib\site-packages\pandas\io\data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [227]:
all_data={}

In [228]:
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')

In [229]:
price = DataFrame({tic: data['Adj Close']
                 for tic, data in all_data.iteritems()})

In [230]:
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.iteritems()})

In [231]:
returns = price.pct_change()

In [232]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [233]:
returns.MSFT.corr(returns.IBM)

0.49597962610315455

In [234]:
returns.MSFT.cov(returns.IBM)

0.0002159576007674314

In [235]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [236]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [238]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [239]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

# Unique Values, Value Counts and Membership

In [240]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [241]:
uniques = obj.unique()

In [242]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [243]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [244]:
pd.value_counts(obj.values,sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [246]:
mask = obj.isin(['b','c'])

In [247]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [248]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [249]:
data = DataFrame({'Qu1' : [1,3,4,3,4],
                  'Qu2' : [2,3,1,2,3],
                  'Qu3' : [1,5,2,4,4]})

In [250]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [252]:
result = data.apply(pd.value_counts).fillna(0)

In [253]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Handling Missing Data

In [255]:
string_data = Series(['aardvark','artichoke',np.nan,'avacado'])

In [256]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [257]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [258]:
string_data[0] = None

In [259]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# Filtering our Missing Data

In [260]:
from numpy import nan as NA

In [261]:
data = Series([1, NA, 3.5, NA, 7])

In [262]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [263]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [264]:
data = DataFrame([[1.,6.5,3],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [265]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [266]:
cleaned = data.dropna()

In [267]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [268]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [269]:
data[4] = NA

In [270]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [271]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [272]:
df = DataFrame(np.random.randn(7,3))

In [273]:
df.ix[:4,1] = NA;
df.ix[:2,2] = NA

In [274]:
df

          0         1         2
0  0.397230       NaN       NaN
1 -1.052505       NaN       NaN
2 -0.633731       NaN       NaN
3 -0.436860       NaN -0.194625
4 -0.018667       NaN  1.668060
5  0.210919 -0.672170  0.495487
6  1.057527 -0.126996 -0.253389

In [275]:
df.dropna(thresh=3)

          0         1         2
5  0.210919 -0.672170  0.495487
6  1.057527 -0.126996 -0.253389

# Filling in Missing Data

In [276]:
df.fillna(0)

          0         1         2
0  0.397230  0.000000  0.000000
1 -1.052505  0.000000  0.000000
2 -0.633731  0.000000  0.000000
3 -0.436860  0.000000 -0.194625
4 -0.018667  0.000000  1.668060
5  0.210919 -0.672170  0.495487
6  1.057527 -0.126996 -0.253389

In [277]:
df.fillna({1: 0.5,3: -1})

          0         1         2
0  0.397230  0.500000       NaN
1 -1.052505  0.500000       NaN
2 -0.633731  0.500000       NaN
3 -0.436860  0.500000 -0.194625
4 -0.018667  0.500000  1.668060
5  0.210919 -0.672170  0.495487
6  1.057527 -0.126996 -0.253389

In [278]:
_ = df.fillna(0, inplace=True)

In [279]:
df

          0         1         2
0  0.397230  0.000000  0.000000
1 -1.052505  0.000000  0.000000
2 -0.633731  0.000000  0.000000
3 -0.436860  0.000000 -0.194625
4 -0.018667  0.000000  1.668060
5  0.210919 -0.672170  0.495487
6  1.057527 -0.126996 -0.253389

In [280]:
df = DataFrame(np.random.randn(6,3))

In [281]:
df.ix[2:,1] = NA;
df.ix[4:,2] = NA

In [282]:
df

          0         1         2
0  1.943207 -0.940622  0.107307
1  0.204692  0.342162  0.398082
2 -1.053299       NaN  0.325932
3  0.909767       NaN -0.880849
4  1.073041       NaN       NaN
5 -1.451815       NaN       NaN

In [283]:
data = Series([1.,NA,3.5,NA,7])

In [284]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Heirarichal Indexing

In [285]:
data = Series(np.random.randn(10), 
              index = [['a','a','a','b','b','b','c','c','d','d'],
                      [1,2,3,1,2,3,1,2,2,3]])

In [286]:
data

a  1   -1.170507
   2    0.065418
   3    1.792282
b  1    0.630011
   2   -0.667583
   3    1.852326
c  1   -0.720761
   2    0.740727
d  2    0.938640
   3   -1.551111
dtype: float64

In [287]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [288]:
data['b']

1    0.630011
2   -0.667583
3    1.852326
dtype: float64

In [289]:
data['b':'c']

b  1    0.630011
   2   -0.667583
   3    1.852326
c  1   -0.720761
   2    0.740727
dtype: float64

In [290]:
data.ix[['b','d']]

b  1    0.630011
   2   -0.667583
   3    1.852326
d  2    0.938640
   3   -1.551111
dtype: float64

In [291]:
data[:2]

a  1   -1.170507
   2    0.065418
dtype: float64

In [292]:
data.unstack()

          1         2         3
a -1.170507  0.065418  1.792282
b  0.630011 -0.667583  1.852326
c -0.720761  0.740727       NaN
d       NaN  0.938640 -1.551111

In [293]:
data.unstack().stack()

a  1   -1.170507
   2    0.065418
   3    1.792282
b  1    0.630011
   2   -0.667583
   3    1.852326
c  1   -0.720761
   2    0.740727
d  2    0.938640
   3   -1.551111
dtype: float64

In [295]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                  index=[['a','a','b','b'],[1,2,1,2]],
                  columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [296]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [297]:
frame.index.names = ['key1','key2']

In [298]:
frame.columns.names = ['state','color']

In [299]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [300]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

# Reordering and Sorting levels

In [301]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [302]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [303]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

# Summary Statistic by level

In [304]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [305]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10